src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология/Ext/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////// 
// Подсистема "Контактная информация".
// 
//////////////////////////////////////////////////////////////////////////////////////////////////// 

#Область СлужебныеПроцедурыИФункции

// Если XMLСтрока еще не задана, то ОжидаемыйВид - обязательный параметр
//
Процедура УстановитьКомментарийКонтактнойИнформации(XMLСтрока, Комментарий, ОжидаемыйВид = Неопределено) Экспорт
	
	Если ПустаяСтрока(XMLСтрока) Тогда
		XMLСтрока = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению("", ОжидаемыйВид);
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.УстановитьКомментарийКонтактнойИнформации(XMLСтрока, Комментарий);
	
КонецПроцедуры

// Описание см. УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению()
//
Функция КонтактнаяИнформацияПоПредставлению(Представление, ОжидаемыйВид, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияПоПредставлению(Представление, ОжидаемыйВид,, СтруктурнаяЕдиница));
	
КонецФункции

// Разбирает представление контактной информации и возвращает строку XML со значениями полей.
// 
//  Параметры:
//// Функция-обертка для вызова с клиента.
//// Описание см. УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению()
//      Текст        - Строка - XML
//      ОжидаемыйТип - СправочникСсылка.ВидыКонтактнойИнформации, ПеречислениеСсылка.ТипыКонтактнойИнформации - для
//                     контроля типов.
// 
//  Возвращаемое значение:
//      Строка - XML
// 
Функция КонтактнаяИнформацияXMLПоПредставлению(Представление, ОжидаемыйВид) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOВXML(
		УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ОжидаемыйВид));
	
КонецФункции

// Возвращает список идентификаторов строк доступных для копирования в текущий адресов.
// 
Функция ДоступныеДляКопированияАдреса(Знач ЗначенияПолейДляАнализа, Знач ВидАдреса) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебный.ДоступныеДляКопированияАдреса(ЗначенияПолейДляАнализа, ВидАдреса);
	
КонецФункции

// Возвращает таблицу, содержащую контактную информацию нескольких объектов. 
//
// Параметры:
//    СсылкиИлиОбъекты         - Массив - владельцы контактной информации.
//    ТипыКонтактнойИнформации - Массив, ПеречислениеСсылка.ТипыКонтактнойИнформации - Если указаны, то будет получена
//        контактная информация только этих типов.
//    ВидыКонтактнойИнформации - Массив, СправочникСсылка.ВидыКонтактнойИнформации   - Если указаны, то будет возвращена
//                               контактная информация только этих видов контактной информации.
//    Дата                     - Дата   - необязательный, дата с которой действует запись контактной информации,
//                              используется при хранении истории изменения контактной информации.
//                              Если владелец хранит историю изменений, то при несоответствии параметра
//                              дате будет вызвано исключение.
//
// Возвращаемое значение:
//  ТаблицаЗначений -  таблица с контактной информацией объектов содержащая колонки:
//    * Объект           - Ссылка - Владелец контактной информации.
//    * Вид              - СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации.
//    * Тип              - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации.
//    * Значение         - Строка - контактная информация во внутреннем формате JSON.
//    * Представление    - Строка - Представление контактной информации.
//    * Дата             - Дата - Дата, с которой действует запись контактной информации.
//    * ИдентификаторСтрокиТабличнойЧасти - Число - Идентификатор строки этой табличной части
//    * ЗначенияПолей    - Строка - устаревший XML, соответствующий XDTO пакетам КонтактнаяИнформация или Адрес. Для
//                                  обратной совместимости.
//
Функция КонтактнаяИнформацияОбъектов(СсылкиИлиОбъекты, Знач ТипыКонтактнойИнформации = Неопределено, Знач ВидыКонтактнойИнформации = Неопределено, Дата = Неопределено) Экспорт
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(СсылкиИлиОбъекты, ТипыКонтактнойИнформации, ВидыКонтактнойИнформации, Дата);
	
КонецФункции

// Возвращает таблицу, содержащую контактную информацию объекта.
// Поведение, при котором возвращалось представление контактной информации, теперь считается устаревшим
// и сохранено для обратной совместимости. Для получения представления контактной информации рекомендуется
// использовать функцию ПредставлениеКонтактнойИнформацииОбъекта.
//
// Параметры:
//  СсылкаИлиОбъект          - ЛюбаяСсылка, Объект - Ссылка или объект-владелец контактной информации (организация,
//                                            контрагент, партнер и т.д.).
//  ВидКонтактнойИнформации  - СправочникСсылка.ВидыКонтактнойИнформации - Необязательный, отбор по виду контактной информации.
//  Дата                     - Дата - необязательный, дата с которой действует запись контактной информации,
//                              используется при хранении истории изменения контактной информации.
//                              Если владелец хранит историю изменений, то при несоответствии параметра
//                              дате будет вызвано исключение.
//  ТолькоПредставление      - Булево - Если Истина, то возвращает только представление, иначе таблицу значений.
//                                      Для получения представления рекомендуется использовать функцию ПредставлениеКонтактнойИнформацииОбъекта.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с контактной информацией объекта содержащая колонки:
//    * Объект           - Ссылка - Владелец контактной информации.
//    * Вид              - СправочникСсылка.ВидыКонтактнойИнформации   - Вид контактной информации.
//    * Тип              - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации.
//    * Значение         - Строка - контактная информация во внутреннем формате JSON.
//    * Представление    - Строка - Представление контактной информации.
//    * Дата             - Дата   - дата, с которой действует запись контактной информации.
//    * ИдентификаторСтрокиТабличнойЧасти - Число - Идентификатор строки этой табличной части
//    * ЗначенияПолей    - Строка - устаревший XML, соответствующий XDTO пакетам КонтактнаяИнформация или Адрес. Для
//                                  обратной совместимости.
//
Функция КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидКонтактнойИнформации = Неопределено, Дата = Неопределено, ТолькоПредставление = Истина) Экспорт
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаИлиОбъект, ВидКонтактнойИнформации, Дата, ТолькоПредставление);
	
КонецФункции

//  Возвращает значения всей контактной информации определенного вида для объекта-владельца
// 
//  Параметры:
//      Ссылка                  - ЛюбаяСсылка - ссылка на объект 
//													- владелец контактной информации (организация, контрагент, партнер и т.д.)
//      ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации - параметры обработки
// 
//  Возвращаемое значение:
//      Таблица значений -информация. Колонками: 
//          * НомерСтроки     - Число     - номер строки дополнительной табличной части объекта-владельца
//          * Представление   - Строка    - представление КИ, введенное пользователем
//          * СтруктураПолей  - Структура - пары ключ-значение данных информации
// 
Функция ТаблицаКонтактнойИнформацииОбъекта(Ссылка, ВидКонтактнойИнформации) Экспорт
	
	Запрос = Новый Запрос(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("
		|ВЫБРАТЬ 
		|	Данные.ИдентификаторСтрокиТабличнойЧасти КАК НомерСтроки,
		|	Данные.Представление                     КАК Представление,
		|	Данные.ЗначенияПолей                     КАК ЗначенияПолей
		|ИЗ
		|	%1.КонтактнаяИнформация КАК Данные
		|ГДЕ
		|	Данные.Ссылка = &Ссылка
		|	И Данные.Вид = &Вид
		|УПОРЯДОЧИТЬ ПО
		|	Данные.ИдентификаторСтрокиТабличнойЧасти
		|", Ссылка.Метаданные().ПолноеИмя()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Вид", ВидКонтактнойИнформации);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НомерСтроки");
	Результат.Колонки.Добавить("Представление");
	Результат.Колонки.Добавить("СтруктураПолей");
	Результат.Индексы.Добавить("НомерСтроки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, Выборка, "НомерСтроки, Представление");
		СтрокаДанных.СтруктураПолей = УправлениеКонтактнойИнформацией.ПредыдущаяСтруктураКонтактнойИнформацииXML(
			Выборка.ЗначенияПолей, ВидКонтактнойИнформации);
	КонецЦикла;
	
	Возврат  Результат;
КонецФункции

// Предназначена для создания временной таблицы с контактной информацией нескольких объектов
// 
// Параметры:
//    МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - для формирования
//    МассивОбъектов - Массив - владельцы контактной информации, все элементы должны быть одного типа
//    ТипыКИ         - Массив - необязательный, используется если не задан все типы
//    ВидыКИ         - Массив -  необязательный, используется если не задан все виды
// 
// В менеджере создается временная таблица ВТКонтактнаяИнформация с полями:
//    * Объект        - Ссылка - владелец КИ
//    * Вид           - СправочникСсылка.ВидыКонтактнойИнформации
//    * Тип           - ПеречислениеСсылка.ТипыКонтактнойИнформации
//    * ЗначенияПолей - Строка - данные значений полей
//    * Представление - Строка - представление КИ
// 
Процедура СоздатьВТКонтактнаяИнформация(МенеджерВременныхТаблиц, МассивОбъектов, ТипыКИ = Неопределено, ВидыКИ = Неопределено) Экспорт
	
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") И МассивОбъектов.Количество() > 0 Тогда
		Ссылка = МассивОбъектов.Получить(0);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неверное значение для массива владельцев контактной информации.'");
	КонецЕсли;
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Ссылка КАК Объект,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	КонтактнаяИнформация.Тип КАК Тип,
		|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТКонтактнаяИнформация
		|ИЗ
		|	" + Ссылка.Метаданные().ПолноеИмя() + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка В (&МассивОбъектов)
		|	" + ?(ТипыКИ = Неопределено, "", "И КонтактнаяИнформация.Тип В (&ТипыКИ)") + "
		|	" + ?(ВидыКИ = Неопределено, "", "И КонтактнаяИнформация.Вид В (&ВидыКИ)") + "
		|");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ТипыКИ", ТипыКИ);
	Запрос.УстановитьПараметр("ВидыКИ", ВидыКИ);
	
	Запрос.Выполнить();
КонецПроцедуры

// Преобразует входящие форматы контактной информации во внутренний формат JSON.
//
// Параметры:
//    КонтактнаяИнформация - Строка - строка в формате XML. Структура XML-документа соответствует XDTO-пакету КонтактнаяИнформация
//                                    или Адрес (для адресов содержащих поля с национальной спецификой).
//                                    Если передана строка во внутреннем формате JSON, то возвращаемое значение будет
//                                    полностью совпадать с ней.
//                         - см. УправлениеКонтактнойИнформациейКлиентСервер.СтруктураКонтактнойИнформацииПоТипу.
//                                       см. РаботаСАдресами.ПоляАдреса (для адресов содержащих поля с национальной спецификой),
//                                       см. РаботаСАдресамиКлиентСервер.СтруктураКонтактнойИнформацииПоТипу
//                                       (для других типов контактной информации содержащих поля с национальной спецификой).
//    ОжидаемыйВид - СправочникСсылка.ВидыКонтактнойИнформации, ПеречислениеСсылка.ТипыКонтактнойИнформации -
//                   используется для определения типа контактной информации, если его невозможно определить из
//                   переданной контактной информации в параметре КонтактнаяИнформация.
//
// Возвращаемое значение:
//     Строка - контактная информация во внутреннем формате JSON.
//              Поля и их описание см. УправлениеКонтактнойИнформациейКлиентСервер.ОписаниеНовойКонтактнойИнформации.
//              Дополнительные поля для конфигурации с поддержкой национальной специфики см. РаботаСАдресамиКлиентСервер.ОписаниеНовойКонтактнойИнформации
//
Функция КонтактнаяИнформацияВJSON(Знач КонтактнаяИнформация, Знач ОжидаемыйВид = Неопределено) Экспорт
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(КонтактнаяИнформация) Тогда
		Возврат КонтактнаяИнформация;
	КонецЕсли;
	
	КонтактнаяИнформацияПоПолям = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(КонтактнаяИнформация, ОжидаемыйВид,,  Ложь);
	Возврат УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(КонтактнаяИнформацияПоПолям);
	
КонецФункции

// Возвращает представление контактной информации (адреса, телефона, электронной почты и т.п.).
//
// Параметры:
//    КонтактнаяИнформация - Строка     - строка JSON или XML контактной информации соответствующая XDTO пакетам
//                         КонтактнаяИнформация или Адрес
//                         - ОбъектXDTO - XDTO-объект КонтактнаяИнформация или Адрес.
//                         - Структура  - контактная информация с разбивкой по полям полученная функциями
//                                        СведенияОбАдресе или СведенияОТелефоне.
//    ВидКонтактнойИнформации - Структура - дополнительные параметры, влияющие на формирование представления адреса:
//      * ВключатьСтрануВПредставление - Булево - в представление будет включена страна адреса;
//      * ФорматАдреса                 - Строка - варианты: "ФИАС" или "КЛАДР".
//                                                Если указано "КЛАДР", то в представление адреса
//                                                не включаются значения уровней округ и внутригородской район.
//
// Возвращаемое значение:
//    Строка - представление контактной информации.
//
Функция ПредставлениеКонтактнойИнформации(Знач КонтактнаяИнформация, Знач ВидКонтактнойИнформации = Неопределено) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебный.ПредставлениеКонтактнойИнформации(КонтактнаяИнформация, ВидКонтактнойИнформации);
	
КонецФункции

// Функция - JSONВКонтактную информацию по полям
//
// Параметры:
//  Значение				 - 	 - 
//  ТипКонтактнойИнформации	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция JSONВКонтактнуюИнформациюПоПолям(Значение, ТипКонтактнойИнформации) Экспорт
	
	Результат = Новый Структура();
	
	КонтактнаяИнформация = СтрокуJSONВСтруктуру(Значение);
	
	Если Не ЗначениеЗаполнено(ТипКонтактнойИнформации) Тогда
		Если КонтактнаяИнформация.Свойство("type") Тогда
			ТипКонтактнойИнформации = ТипКонтактнойИнформацииИзСтроки(КонтактнаяИнформация.type);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.ОбщиеМодули.Найти("РаботаСАдресамиКлиентСервер") <> Неопределено Тогда
		МодульРаботаСАдресамиКлиентСервер = ОбщегоНазначения.ОбщийМодуль("РаботаСАдресамиКлиентСервер");
		Результат = МодульРаботаСАдресамиКлиентСервер.ОписаниеНовойКонтактнойИнформации(ТипКонтактнойИнформации);
	Иначе
		Результат = УправлениеКонтактнойИнформациейКлиентСервер.ОписаниеНовойКонтактнойИнформации(ТипКонтактнойИнформации);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, КонтактнаяИнформация);
	
	Возврат Результат;
	
КонецФункции

// Функция - Контактная информация из JSONВXML
//
// Параметры:
//  КонтактнаяИнформация - 	 - 
//  ОжидаемыйТип		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция КонтактнаяИнформацияИзJSONВXML(Знач КонтактнаяИнформация, ОжидаемыйТип = Неопределено, Представление = "") Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияИзJSONВXML(КонтактнаяИнформация, ОжидаемыйТип, Представление);

КонецФункции

// Функция - Строку JSONВСтруктуру
//
// Параметры:
//  Значение - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СтрокуJSONВСтруктуру(Значение) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	
	Результат = ПрочитатьJSON(ЧтениеJSON,,,, "ВосстановлениеПолейКонтактнойИнформации", УправлениеКонтактнойИнформациейСлужебный);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

// Функция - Тип контактной информации из строки
//
// Параметры:
//  ТипКонтактнойИнформацииСтрокой	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ТипКонтактнойИнформацииИзСтроки(Знач ТипКонтактнойИнформацииСтрокой)
	
	Результат = Новый Соответствие;
	Результат.Вставить("Адрес", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	Результат.Вставить("Телефон", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	Результат.Вставить("АдресЭлектроннойПочты", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	Результат.Вставить("Skype", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Skype"));
	Результат.Вставить("ВебСтраница", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ВебСтраница"));
	Результат.Вставить("Факс", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс"));
	Результат.Вставить("Другое", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Другое"));
	
	Возврат Результат[ТипКонтактнойИнформацииСтрокой];
	
КонецФункции

// Процедура устанавливает переданный Email как адрес электронной почты контрагента
// Возвращает Истина если E-mail был установлен для клиента
//
Функция ПрисвоитьEmailКонтрагенту(Контрагент, Email) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты")
		ИЛИ НЕ ЗначениеЗаполнено(Email) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Попытка
		
		КонтрагентОбъект = Контрагент.Получитьобъект();
		
		СтрокаEmail = КонтрагентОбъект.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, "Тип");
		
		Если СтрокаEmail = Неопределено Тогда
			СтрокаEmail 	= КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			СтрокаEmail.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтрокаEmail.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
		КонецЕсли;
		
		СообщениеОбОшибке = "";
		СтрокаEmail.Представление = СокрЛП(Email);
		ЗаполнитьРеквизитыТабличнойЧастиДляАдресаЭлектроннойПочты(СтрокаEmail, СообщениеОбОшибке);
		
		Если НЕ ПустаяСтрока(СообщениеОбОшибке) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, Контрагент);
			Возврат Ложь;
		Иначе
			КонтрагентОбъект.Записать();
		КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ОписаниеОшибки()), Контрагент);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Для адреса электронной почты
Процедура ЗаполнитьРеквизитыТабличнойЧастиДляАдресаЭлектроннойПочты(СтрокаТабличнойЧасти, СообщениеОбОшибке = "")
	
	Попытка
		Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(СтрокаТабличнойЧасти.Представление);
	Исключение
		СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Если Результат.Количество() > 0 Тогда
		СтрокаТабличнойЧасти.АдресЭП = Результат[0].Адрес;
		
		Поз = Найти(СтрокаТабличнойЧасти.АдресЭП, "@");
		Если Поз <> 0 Тогда
			СтрокаТабличнойЧасти.ДоменноеИмяСервера = Сред(СтрокаТабличнойЧасти.АдресЭП, Поз+1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Преобразовать номер телефона
//
// Параметры:
//  Представление		 - 	 - 
//  СписокПолей			 - 	 - 
//  Касса				 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//
Процедура ПреобразоватьНомерТелефона(Представление, СписокПолей, Касса = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(Представление, СписокПолей, Касса, СтруктурнаяЕдиница);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Начать преобразование формата телефонных номеров
//
Функция НачатьПреобразованиеФорматаТелефонныхНомеров(УникальныйИдентификатор, ПараметрыПреобразования = Неопределено) Экспорт
	
	Возврат УправлениеКонтактнойИнформациейСлужебныйПовтИспСтоматология.НачатьПреобразованиеФорматаТелефонныхНомеров(УникальныйИдентификатор, ПараметрыПреобразования);
	
КонецФункции

#КонецОбласти
